# *Import Pandas*

In [2]:
import pandas as pd
import numpy as np

# *Pandas Dictionary*

In [3]:
#Create a dictionary

my_dict = {'Alex': 5,
          'Ben':10,
          'Carly':12,
          'Danielle':7,
          'Evan':6}
my_dict

{'Alex': 5, 'Ben': 10, 'Carly': 12, 'Danielle': 7, 'Evan': 6}

In [4]:
#Access Pythin Dictionary
my_dict['Ben']

10

In [5]:
my_dict.get('Ben') #rarely use

10

In [6]:
#Manipulate Python Dictionary
# Add value
my_dict['Ujang'] = 10
my_dict

{'Alex': 5, 'Ben': 10, 'Carly': 12, 'Danielle': 7, 'Evan': 6, 'Ujang': 10}

In [7]:
# Change value
my_dict['Ben'] = 7
my_dict

{'Alex': 5, 'Ben': 7, 'Carly': 12, 'Danielle': 7, 'Evan': 6, 'Ujang': 10}

In [8]:
my_dict.pop('Ujang') # Delete with Pop()
my_dict

{'Alex': 5, 'Ben': 7, 'Carly': 12, 'Danielle': 7, 'Evan': 6}

In [9]:
del my_dict['Alex'] # Delete with []
my_dict

{'Ben': 7, 'Carly': 12, 'Danielle': 7, 'Evan': 6}

In [10]:
for i, j in my_dict.items():
    print(f'This is key {i} with value {j}')

This is key Ben with value 7
This is key Carly with value 12
This is key Danielle with value 7
This is key Evan with value 6

In [11]:
for i, j in my_dict.items():
    print('This is key, {} with value {}'.format(i,j))

This is key, Ben with value 7
This is key, Carly with value 12
This is key, Danielle with value 7
This is key, Evan with value 6

In [12]:
# Create the list, array, and the label for creating series
theList = [100, 200, 300]
theArray = np.array([100, 200, 300])
theLabel = ['Pertama', 'Kedua', 'Ketiga']
theDict = {'Pertama':100, 'Kedua':200, 'Ketiga':300}

theListSeries = pd.Series(data=theList, index=theLabel)
theArraySeries = pd.Series(theArray, theLabel)
theDictSeries = pd.Series(theDict)

print(theListSeries)

Pertama    100
Kedua      200
Ketiga     300
dtype: int64

In [13]:
print(theArraySeries)

Pertama    100
Kedua      200
Ketiga     300
dtype: int32

In [14]:
print(theDictSeries)

Pertama    100
Kedua      200
Ketiga     300
dtype: int64

## *Creating Data Frame*

In [15]:
pd.DataFrame({'adhi':180, 'maya':165, 'ujang':170}, index=[1, 2, 3])

   adhi  maya  ujang
1   180   165    170
2   180   165    170
3   180   165    170

In [16]:
pd.DataFrame({'adhi':180, 'maya':165, 'ujang':170}, index=[1, 2, 3]).transpose()

         1    2    3
adhi   180  180  180
maya   165  165  165
ujang  170  170  170

In [23]:
dictHeight = {'adhi':180, 'maya':165, 'ujang':170 }
seriesHeight = pd.Series(dictTinggi)
dataMahasiswa = pd.DataFrame(seriesTinggi, columns=['Height'])
dataMahasiswa

       Height
adhi      180
maya      165
ujang     170

In [38]:
dataMahasiswa['Weight'] = [80,55,75]
dataMahasiswa['University'] = ['ITB', 'UI', 'UB']
dataMahasiswa['GPA'] = [3.4, 4.0, 3.2]
dataMahasiswa['Age'] = [19, 20, 19]
dataMahasiswa

       Height  Weight UniversitY  GPA  Age       IMT University
adhi      180      80        ITB  3.4   19  0.024691        ITB
maya      165      55         UI  4.0   20  0.020202         UI
ujang     170      75         UB  3.2   19  0.025952         UB

In [39]:
#Create a new column
dataMahasiswa['BMI'] = dataMahasiswa['Weight']/((dataMahasiswa['Height']/10)*dataMahasiswa['Height'])
dataMahasiswa

       Height  Weight UniversitY  GPA  Age       IMT University       BMI
adhi      180      80        ITB  3.4   19  0.024691        ITB  0.024691
maya      165      55         UI  4.0   20  0.020202         UI  0.020202
ujang     170      75         UB  3.2   19  0.025952         UB  0.025952

In [40]:
#Remove a column without inplace
print(dataMahasiswa.drop('BMI', axis=1))
print("-"*75)
print(dataMahasiswa)

       Height  Weight UniversitY  GPA  Age       IMT University
adhi      180      80        ITB  3.4   19  0.024691        ITB
maya      165      55         UI  4.0   20  0.020202         UI
ujang     170      75         UB  3.2   19  0.025952         UB
---------------------------------------------------------------------------
       Height  Weight UniversitY  GPA  Age       IMT University       BMI
adhi      180      80        ITB  3.4   19  0.024691        ITB  0.024691
maya      165      55         UI  4.0   20  0.020202         UI  0.020202
ujang     170      75         UB  3.2   19  0.025952         UB  0.025952

In [41]:
#Remove a column with inplace
dataMahasiswa.drop('BMI', axis=1, inplace=True)
dataMahasiswa

       Height  Weight UniversitY  GPA  Age       IMT University
adhi      180      80        ITB  3.4   19  0.024691        ITB
maya      165      55         UI  4.0   20  0.020202         UI
ujang     170      75         UB  3.2   19  0.025952         UB

In [42]:
dataMahasiswa[(dataMahasiswa['GPA']>3)&(dataMahasiswa['Age']<20)]

       Height  Weight UniversitY  GPA  Age       IMT University
adhi      180      80        ITB  3.4   19  0.024691        ITB
ujang     170      75         UB  3.2   19  0.025952         UB

In [43]:
dataMahasiswa[dataMahasiswa['University']=='UI']

      Height  Weight UniversitY  GPA  Age       IMT University
maya     165      55         UI  4.0   20  0.020202         UI

In [44]:
#Select a single variable
print(dataMahasiswa['University'])
print("-"*40)

#select a multiple Variable
print(dataMahasiswa[['University', 'GPA']])
print("-"*40)

# Selecting using SQL Syntax (Not Recommended)
print(dataMahasiswa.Height)

adhi     ITB
maya      UI
ujang     UB
Name: University, dtype: object
----------------------------------------
      University  GPA
adhi         ITB  3.4
maya          UI  4.0
ujang         UB  3.2
----------------------------------------
adhi     180
maya     165
ujang    170
Name: Height, dtype: int64

In [45]:
dataMahasiswa[['GPA', 'University']]

       GPA University
adhi   3.4        ITB
maya   4.0         UI
ujang  3.2         UB

In [26]:
pwd # working directory untuk ngasih file

'C:\\Users\\danie\\Shift Academy Data Science Bootcamp Batch 10'

In [27]:
titanic = pd.read_csv('D:\## MOOC Webinnar dan Pelatihan\Awardee Shift Academy Data Science Bootcamp 10\Day 8 Mingggu, 28 Maret 2021\data_titanic.csv')

In [28]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [29]:
# No1
nmale = len(titanic[titanic['Sex'] == 'male'])
nfemale = len(titanic[titanic['Sex'] == 'female'])
print(nmale, nfemale)

577 314